app/Controllers/Admin.php

    public function kullanici_listesi()
    {
        $userModel = new UserModel();
        $users = $userModel->findAll(); // Veritabanındaki tüm kullanıcıları al
---
SELECT *
FROM `users`

    public function kullanici_duzenle($id)
    {
        $userModel = new UserModel();
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'

    public function edit_about()
    {
        $aboutModel = new AboutPageModel();
        $about = $aboutModel->find(1); // ID 1 ile Hakkında sayfasını bul
---
SELECT *
FROM `about_page`
WHERE `about_page`.`id` = 1