app/Controllers/Giris.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function index()
    {
        $data = []; // Görünüme gönderilecek veriler

        if ($this->request->getMethod() === 'post') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('username', $username)->first();