app/Controllers/KullaniciEkle.php

SELECT *
FROM `users`
WHERE `username` = 'veli hoca'
 LIMIT 1
---
    public function addUser()
    {
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Kullanıcı adı kontrolü
        if ($userModel->where('username', $username)->first()) {