app/Models/UserModel.php

INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES ('veli hoca', '$2y$10$EZNINIy0triMv3A/GgvX0uMcEVZWiV.4y24F3xAanbqiXeHi0dmJS', '2024-12-25 14:50:07', '2024-12-25 14:50:07')
---
    public function addUser($username, $password)
    {
        // Şifreyi hashle
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        // Kullanıcıyı ekle
        return $this->insert([
            'username' => $username,
            'password' => $hashedPassword
        ]);